# Data Frames

### like a spreadsheet -

In [9]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [5]:
my_data = randn(4,3) # rows and columns
my_rows = ["A","B","C","D"]
my_cols = ["Monday","Tuesday","Wednesday"]

In [6]:
# Crate dataframe
my_df = pd.DataFrame(my_data, my_rows, my_cols)
my_df

     Monday   Tuesday  Wednesday
A  0.791153  0.782443   0.358317
B -0.701856 -1.423892  -2.231330
C -0.349357 -0.396169  -0.755685
D  0.856357  0.045264   0.522416

In [7]:
# import csv file
my_df2 = pd.read_csv('animal.csv')
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No

In [10]:
# pull out rows
my_df2.loc[[0, 2,8]]

KeyError: '[8] not in index'

In [ ]:
# grab the first 5 rows
my_df2.head()

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No
4,5,Frog,Amphibian,Wetlands,8,0.5,No

In [ ]:
my_df2.head(9)

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No
4,5,Frog,Amphibian,Wetlands,8,0.5,No
5,6,Penguin,Bird,Antarctica,20,30.0,No
6,7,Tiger,Mammal,Forest,15,220.0,Yes
7,8,Kangaroo,Mammal,Grassland,23,85.0,No
8,9,Snake,Reptile,Desert,12,5.4,No

In [ ]:
my_df2.tail()

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
5,6,Penguin,Bird,Antarctica,20,30.0,No
6,7,Tiger,Mammal,Forest,15,220.0,Yes
7,8,Kangaroo,Mammal,Grassland,23,85.0,No
8,9,Snake,Reptile,Desert,12,5.4,No
9,10,Panda,Mammal,Forest,20,100.0,Yes

In [ ]:
# get info about the datafram
my_df2.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   AnimalID                10 non-null     int64
 1   Animal                  10 non-null     str
 2   Species                 10 non-null     str
 3   Habitat                 10 non-null     str
 4   Average_Lifespan_Years  10 non-null     int64
 5   Weight_kg               10 non-null     float64
 6   Is_Endangered           10 non-null     str
dtypes: float64(1), int64(2), str(4)
memory usage: 692.0 bytes

In [ ]:
# get shape of data frame
my_df2.shape

(10, 7)

In [ ]:
# get dimensionas of the dataframe
my_df2.ndim

2

In [ ]:
# get datatypes
my_df2.dtypes

AnimalID                    int64
Animal                        str
Species                       str
Habitat                       str
Average_Lifespan_Years      int64
Weight_kg                 float64
Is_Endangered                 str
dtype: object

In [ ]:
# get some statsistics of the data
my_df2.describe()

       AnimalID  Average_Lifespan_Years    Weight_kg
count  10.00000               10.000000    10.000000
mean    5.50000               25.200000   713.210000
std     3.02765               17.021555  1679.483082
min     1.00000                8.000000     0.500000
25%     3.25000               14.250000    11.550000
50%     5.50000               20.000000    92.500000
75%     7.75000               28.250000   212.500000
max    10.00000               60.000000  5400.000000

In [ ]:
# describe a speicifc column
my_df2['Average_Lifespan_Years'].describe()

count    10.000000
mean     25.200000
std      17.021555
min       8.000000
25%      14.250000
50%      20.000000
75%      28.250000
max      60.000000
Name: Average_Lifespan_Years, dtype: float64

In [ ]:
# Select specific column usin gbrackets
my_df2['Animal']

0        Lion
1    Elephant
2      Parrot
3       Shark
4        Frog
5     Penguin
6       Tiger
7    Kangaroo
8       Snake
9       Panda
Name: Animal, dtype: str

In [ ]:
# select specific column using dot notation
my_df2.Animal

0        Lion
1    Elephant
2      Parrot
3       Shark
4        Frog
5     Penguin
6       Tiger
7    Kangaroo
8       Snake
9       Panda
Name: Animal, dtype: str

In [ ]:
my_df2.iloc[:,1]

0        Lion
1    Elephant
2      Parrot
3       Shark
4        Frog
5     Penguin
6       Tiger
7    Kangaroo
8       Snake
9       Panda
Name: Animal, dtype: str

# Count Data

In [ ]:
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No
4,5,Frog,Amphibian,Wetlands,8,0.5,No
5,6,Penguin,Bird,Antarctica,20,30.0,No
6,7,Tiger,Mammal,Forest,15,220.0,Yes
7,8,Kangaroo,Mammal,Grassland,23,85.0,No
8,9,Snake,Reptile,Desert,12,5.4,No
9,10,Panda,Mammal,Forest,20,100.0,Yes

In [ ]:
dog= pd.read_csv('dog_data.csv')
dog

                    Breed              Color        DogName  OwnerZip
0                COCKAPOO              BROWN        CHARLEY     15236
1            GER SHEPHERD        BLACK/BROWN         TACODA     15238
2           BELG MALINOIS            BRINDLE           EICH     15238
3                   MIXED        BLACK/BROWN          ARROW     15104
4     AM PIT BULL TERRIER        WHITE/BROWN         OAKLEY     15139
...                   ...                ...            ...       ...
2665         GOLDENDOODLE              BROWN        WINSLOW     15044
2666    YORKSHIRE TERRIER        BLACK/BROWN  ROCKY KALAKOS     15220
2667              LAB MIX  WHITE/BLACK/BROWN          ELLIE     15220
2668         GOLDENDOODLE              WHITE       CLARENCE     15143
2669    SHETLAND SHEEPDOG              BLACK        GRIFFIN     15136

[2670 rows x 4 columns]

In [ ]:
# count disting values - descending
dog['Color'].value_counts()

Color
BLACK                   371
BROWN                   309
WHITE                   226
WHITE/BLACK             196
BLACK/BROWN             183
                       ...
BROWN/ORANGE              1
BLACK/ORANGE/BRINDLE      1
BROWN/FAWN                1
BLACK/BROWN/GREY          1
BROWN/LIVER               1
Name: count, Length: 72, dtype: int64

In [ ]:
# count distinct values- ascending
dog['Color'].value_counts(ascending=True)

Color
BROWN/ORANGE              1
BLACK/ORANGE/BRINDLE      1
BROWN/FAWN                1
BLACK/BROWN/GREY          1
BROWN/LIVER               1
                       ...
BLACK/BROWN             183
WHITE/BLACK             196
WHITE                   226
BROWN                   309
BLACK                   371
Name: count, Length: 72, dtype: int64

In [ ]:
# dog names - without NaN
dog['DogName'].value_counts()

DogName
LUCY             35
BELLA            30
BAILEY           29
BUDDY            29
DAISY            26
                 ..
NINO              1
WINSLOW           1
ROCKY KALAKOS     1
CLARENCE          1
GRIFFIN           1
Name: count, Length: 1428, dtype: int64

In [ ]:
# dog names - with NaN
dog['DogName'].value_counts(dropna=False)

DogName
LUCY             35
BELLA            30
BAILEY           29
BUDDY            29
DAISY            26
                 ..
NINO              1
WINSLOW           1
ROCKY KALAKOS     1
CLARENCE          1
GRIFFIN           1
Name: count, Length: 1429, dtype: int64

In [ ]:
# get relative frequency - Percentage
dog['Color'].value_counts(normalize=True)

Color
BLACK                   0.139212
BROWN                   0.115947
WHITE                   0.084803
WHITE/BLACK             0.073546
BLACK/BROWN             0.068668
                          ...
BROWN/ORANGE            0.000375
BLACK/ORANGE/BRINDLE    0.000375
BROWN/FAWN              0.000375
BLACK/BROWN/GREY        0.000375
BROWN/LIVER             0.000375
Name: proportion, Length: 72, dtype: float64

In [ ]:
# get specified item count
dog['Color'].value_counts()['WHITE']

np.int64(226)

In [ ]:
# count unique values - size
dog.groupby('Color').size()

Color
APRICOT              15
BEIGE                 5
BLACK               371
BLACK WITH WHITE     21
BLACK/BRINDLE         5
                   ...
WHITE/ORANGE          5
WHITE/RED            14
WHITE/TAN            50
WHITE/YELLOW          2
YELLOW               51
Length: 72, dtype: int64

In [ ]:
dog.groupby('Color').count()

                  Breed  DogName  OwnerZip
Color
APRICOT              15       15        15
BEIGE                 5        5         5
BLACK               371      371       371
BLACK WITH WHITE     21       21        21
BLACK/BRINDLE         5        5         5
...                 ...      ...       ...
WHITE/ORANGE          5        5         5
WHITE/RED            14       14        14
WHITE/TAN            50       50        50
WHITE/YELLOW          2        2         2
YELLOW               51       51        51

[72 rows x 3 columns]

In [ ]:
# get a count of all cols across all cols
dog.apply(pd.value_counts)

AttributeError: module 'pandas' has no attribute 'value_counts'

## Add columns in Data Frames

In [ ]:
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No

In [ ]:
# add column from list
gender = ["male","female", "male", "female"]
my_df2["Gender"]= gender
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender
0,1,Lion,Mammal,Savannah,14,190.0,Yes,male
1,2,Elephant,Mammal,Forest,60,5400.0,Yes,female
2,3,Parrot,Bird,Rainforest,50,1.2,No,male
3,4,Shark,Fish,Ocean,30,1100.0,No,female

In [ ]:
# add default values
my_df2["Alive/Dead"] = [True]*len(my_df2)
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender,Alive/Dead
0,1,Lion,Mammal,Savannah,14,190.0,Yes,male,True
1,2,Elephant,Mammal,Forest,60,5400.0,Yes,female,True
2,3,Parrot,Bird,Rainforest,50,1.2,No,male,True
3,4,Shark,Fish,Ocean,30,1100.0,No,female,True

In [ ]:
# add NaN values
my_df2["Show Dog"]= [np.nan]*len(my_df2)
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender,Alive/Dead,Show Dog
0,1,Lion,Mammal,Savannah,14,190.0,Yes,male,True,NaN
1,2,Elephant,Mammal,Forest,60,5400.0,Yes,female,True,NaN
2,3,Parrot,Bird,Rainforest,50,1.2,No,male,True,NaN
3,4,Shark,Fish,Ocean,30,1100.0,No,female,True,NaN

In [ ]:
# add column with .insert() = allows position
my_df2.insert(1, "Adopted", [True]*len(my_df2), True); # position, name of the colum, wha tot insert, default
my_df2

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender,Alive/Dead,Show Dog
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,male,True,NaN
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,female,True,NaN
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,male,True,NaN
3,4,True,True,Shark,Fish,Ocean,30,1100.0,No,female,True,NaN

In [ ]:
# add column with .assign() - creates a new df - cretaes a new datafram so that the old one is secured and unchaned

my_df3 = my_df2.assign(Horse = [False]*len(my_df2))
my_df3

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender,Alive/Dead,Show Dog,Horse
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,male,True,NaN,False
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,female,True,NaN,False
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,male,True,NaN,False
3,4,True,True,Shark,Fish,Ocean,30,1100.0,No,female,True,NaN,False

## Remove columns and rows from data frames

In [ ]:
my_df2

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Gender,Alive/Dead,Show Dog
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,male,True,NaN
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,female,True,NaN
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,male,True,NaN
3,4,True,True,Shark,Fish,Ocean,30,1100.0,No,female,True,NaN

In [ ]:
my_df2.drop("Gender", axis=1, inplace=True)

In [ ]:
my_df2

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Alive/Dead,Show Dog
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,True,NaN
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,True,NaN
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,True,NaN
3,4,True,True,Shark,Fish,Ocean,30,1100.0,No,True,NaN

In [ ]:
# deleting row
my_df2.drop(3, inplace=True)

In [ ]:
my_df2

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Alive/Dead,Show Dog
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,True,NaN
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,True,NaN
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,True,NaN

In [ ]:
my_df2

,AnimalID,Adopted,Adopted,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered,Alive/Dead,Show Dog
0,1,True,True,Lion,Mammal,Savannah,14,190.0,Yes,True,NaN
1,2,True,True,Elephant,Mammal,Forest,60,5400.0,Yes,True,NaN
2,3,True,True,Parrot,Bird,Rainforest,50,1.2,No,True,NaN

## Grab rows, points and Subsets

In [ ]:
my_df2

,AnimalID,Animal,Species,Habitat,Average_Lifespan_Years,Weight_kg,Is_Endangered
0,1,Lion,Mammal,Savannah,14,190.0,Yes
1,2,Elephant,Mammal,Forest,60,5400.0,Yes
2,3,Parrot,Bird,Rainforest,50,1.2,No
3,4,Shark,Fish,Ocean,30,1100.0,No

In [ ]:
# grab row method 1 - Location
my_df2.loc[2]

AnimalID                           3
Animal                        Parrot
Species                         Bird
Habitat                   Rainforest
Average_Lifespan_Years            50
Weight_kg                        1.2
Is_Endangered                     No
Name: 2, dtype: object

In [ ]:
# Grab row method 2 index location
my_df2.iloc[2]

AnimalID                           3
Animal                        Parrot
Species                         Bird
Habitat                   Rainforest
Average_Lifespan_Years            50
Weight_kg                        1.2
Is_Endangered                     No
Name: 2, dtype: object

In [ ]:
# specific points (row and column)
my_df2.loc[1, 'Habitat']

'Forest'

In [ ]:
# subsets 
my_df2.loc[[1,3],['Habitat','Animal','Species']]

NameError: name 'my_df2' is not defined

In [ ]:
my_df

NameError: name 'my_df' is not defined

In [ ]:
my_df2

NameError: name 'my_df2' is not defined